**step-1: Import required Packages**

In [ ]:
import pandas as pd  #dataframe operations ###

In [13]:
import numpy as np #Math oprations

In [11]:
import matplotlib.pyplot as plt #Plotting

In [9]:
import seaborn as sns #Plotting

**Step-2: Create a Dataframe using a list**

In [22]:
names=["Ramesh","Suresh","Mahesh"]
age=[20,22,24]
pd.DataFrame(zip(age,names))

    0       1
0  20  Ramesh
1  22  Suresh
2  24  Mahesh

**pd.DataFrame(data,index,columns)**
- data=None,
- index : Index or array-like
- columns : Index-array-like

In [29]:
names=["Ramesh","Suresh","Mahesh"]
age=[20,22,24]
#pd.DataFrame(data,index,columns)
pd.DataFrame(zip(names,age))

        0   1
0  Ramesh  20
1  Suresh  22
2  Mahesh  24

**Step-3: Add the column names**

In [35]:
names=["Ramesh","Suresh","Mahesh"]
age=[20,22,24]
cols=['Names','Age']
pd.DataFrame(zip(names,age),columns=cols)

    Names  Age
0  Ramesh   20
1  Suresh   22
2  Mahesh   24

In [39]:
names=["Ramesh","Suresh","Mahesh"]
age=[20,22,24]
index=['A','B','C']
cols=['Names','Age']
pd.DataFrame(zip(names,age),index,columns=cols)

    Names  Age
A  Ramesh   20
B  Suresh   22
C  Mahesh   24

**Step-4: Create empty DataFrame and update df**

In [42]:
#Above one we created dataframe with values directly
#Now first we will create empty df
#then we will add the values

df=pd.DataFrame()
df

Empty DataFrame
Columns: []
Index: []

In [ ]:
df['Names']
# If I run this if any column values avaiable under
# otherwise error
# Either you are creating a new column
#

In [44]:
df=pd.DataFrame()
df['Names']=["Ramesh","Suresh","Mahesh"]
df['Age']=[20,22,24]
df

    Names  Age
0  Ramesh   20
1  Suresh   22
2  Mahesh   24

In [46]:
# My dataframe name is df
df['Age']

0    20
1    22
2    24
Name: Age, dtype: int64

In [54]:
df=pd.DataFrame()
df['Names']=["Ramesh","Suresh","Mahesh"]
df['Age']=[20,22,24]
df['Age']=[30,32,34]      #updating
df['age']=[100,200,300]     #creating
df['City']=['Hyd','Blr','Chennai']    #creating
df
# Python case senstive
# 'Age'

    Names  Age  age     City
0  Ramesh   30  100      Hyd
1  Suresh   32  200      Blr
2  Mahesh   34  300  Chennai

**Notes**

- Python case sensitive
- 'Age' and 'age' consider as different
- Updated column values always should be len dataframe
- Dont expect Null like sql if we miss any value

**Step-5 Drop the Column**

- labels :
- axis:'Axis' =0,
- index:
- columns:
- inplace:'bool'=False,

In [62]:
df.drop(2)

    Names  Age  age City
0  Ramesh   30  100  Hyd
1  Suresh   32  200  Blr

In [74]:
df.drop([1,2])  #multiple droping using list

    Names  Age  age City
0  Ramesh   30  100  Hyd

In [66]:
df.drop(2,axis=0)

    Names  Age  age City
0  Ramesh   30  100  Hyd
1  Suresh   32  200  Blr

In [68]:
df.drop(2,axis=1)

KeyError: '[2] not found in axis'

In [70]:
df.drop(20)

KeyError: '[20] not found in axis'

In [76]:
df.drop(columns=['age'])

    Names  Age     City
0  Ramesh   30      Hyd
1  Suresh   32      Blr
2  Mahesh   34  Chennai

In [78]:
df.drop(index=2)

    Names  Age  age City
0  Ramesh   30  100  Hyd
1  Suresh   32  200  Blr

In [80]:
df.drop(index=[2])

    Names  Age  age City
0  Ramesh   30  100  Hyd
1  Suresh   32  200  Blr

In [82]:
df.drop([2],axis=1)

KeyError: '[2] not found in axis'

In [84]:
df.drop('age',axis=1)

    Names  Age     City
0  Ramesh   30      Hyd
1  Suresh   32      Blr
2  Mahesh   34  Chennai

In [86]:
df
df.drop(2)  #workd
df.drop(2,axis=0)  #works
df.drop(2,axis=1)    #fail
df.drop('age',axis=1)  #works
df.drop(labels=[2])  #works
df.drop(columns=['age']) #works

    Names  Age  age City
0  Ramesh   30  100  Hyd
1  Suresh   32  200  Blr

In [96]:
df['age']=[100,200,300] 
df.drop(columns=['age'],inplace=True)
df

    Names  Age     City
0  Ramesh   30      Hyd
1  Suresh   32      Blr
2  Mahesh   34  Chennai

In [ ]:
#Assignment-1
df.rename

In [ ]:
#Assignment-2
df.shape
df.size
df.columns
df.isnull()
len(df)
df.info
df.drop_duplicates
df.dtypes

In [3]:
import pandas as pd

In [5]:
import numpy as np

In [7]:
import matplotlib.pyplot as plt

In [9]:
import seaborn as sns

In [37]:
import pandas as pd

# Correct way to create a DataFrame
df = pd.DataFrame()
df['Names'] = ["Ramesh", "Suresh", "Mahesh"]
df['City'] = ['Hyd', 'Blr', 'Chennai']

# Drop row with index 2
df = df.drop(2)

print(df)

    Names City
0  Ramesh  Hyd
1  Suresh  Blr

In [42]:
import pandas as pd

# Correct way to create a DataFrame
df = pd.DataFrame()
df['Names'] = ["Ramesh", "Suresh", "Mahesh"]
df['City'] = ['Hyd', 'Blr', 'Chennai']
df.drop(2,axis=0)

    Names City
0  Ramesh  Hyd
1  Suresh  Blr

In [44]:
import pandas as pd

# Correct way to create a DataFrame
df = pd.DataFrame()
df['Names'] = ["Ramesh", "Suresh", "Mahesh"]
df['City'] = ['Hyd', 'Blr', 'Chennai']
df.drop(index=2)

    Names City
0  Ramesh  Hyd
1  Suresh  Blr

In [46]:
import pandas as pd

# Correct way to create a DataFrame
df = pd.DataFrame()
df['Names'] = ["Ramesh", "Suresh", "Mahesh"]
df['City'] = ['Hyd', 'Blr', 'Chennai']
df.drop([1,2])

    Names City
0  Ramesh  Hyd

In [48]:
import pandas as pd

# Correct way to create a DataFrame
df = pd.DataFrame()
df['Names'] = ["Ramesh", "Suresh", "Mahesh"]
df['City'] = ['Hyd', 'Blr', 'Chennai']
df.drop([1,2],axis=0)

    Names City
0  Ramesh  Hyd

In [50]:
import pandas as pd

# Correct way to create a DataFrame
df = pd.DataFrame()
df['Names'] = ["Ramesh", "Suresh", "Mahesh"]
df['City'] = ['Hyd', 'Blr', 'Chennai']
df.drop(index=[1,2])

    Names City
0  Ramesh  Hyd

In [52]:
import pandas as pd

# Correct way to create a DataFrame
df = pd.DataFrame()
df['Names'] = ["Ramesh", "Suresh", "Mahesh"]
df['City'] = ['Hyd', 'Blr', 'Chennai']
df.drop('City',axis=1)

    Names
0  Ramesh
1  Suresh
2  Mahesh

In [54]:
import pandas as pd

# Correct way to create a DataFrame
df = pd.DataFrame()
df['Names'] = ["Ramesh", "Suresh", "Mahesh"]
df['City'] = ['Hyd', 'Blr', 'Chennai']
df.drop(['City','Names'],axis=1)

Empty DataFrame
Columns: []
Index: [0, 1, 2]

In [56]:
import pandas as pd

# Correct way to create a DataFrame
df = pd.DataFrame()
df['Names'] = ["Ramesh", "Suresh", "Mahesh"]
df['City'] = ['Hyd', 'Blr', 'Chennai']
df.columns
dict1={'City':'city'}
df.rename(dict1,axis=1)

    Names     city
0  Ramesh      Hyd
1  Suresh      Blr
2  Mahesh  Chennai

In [58]:
import pandas as pd

# Correct way to create a DataFrame
df = pd.DataFrame()
df['Names'] = ["Ramesh", "Suresh", "Mahesh"]
df['City'] = ['Hyd', 'Blr', 'Chennai']
df.columns
dict1={'City':'city'}
df.rename(columns=dict1)

    Names     city
0  Ramesh      Hyd
1  Suresh      Blr
2  Mahesh  Chennai

In [74]:
import pandas as pd

df = pd.DataFrame()
df['Names'] = ["Ramesh", "Suresh", "Mahesh"]
df['City'] = ['Hyd', 'Blr', 'Chennai']

df.columns = ['A', 'B']            #  Only 2 names for 2 columns
df.index = ['11', '22', '33']      #  3 row labels for 3 rows

print(df)

         A        B
11  Ramesh      Hyd
22  Suresh      Blr
33  Mahesh  Chennai

**Append the Row**

- we need to use **loc**
- 
- df.loc [<row numbers>,<column names>]
- 
- example : df.loc [2,'City']
- 
- muliple rows from multiple columns
- 
- example:df.loc[[1,2],['Names','City']]
- 
- df.loc[start:stop:step,]
- 
- example:df.loc[0:3,'City']

In [82]:
import pandas as pd

df = pd.DataFrame()
df['Names'] = ["Ramesh", "Suresh", "Mahesh"]
df['City'] = ['Hyd', 'Blr', 'Chennai']

df.loc[2,'City']

'Chennai'

In [84]:
import pandas as pd

df = pd.DataFrame()
df['Names'] = ["Ramesh", "Suresh", "Mahesh"]
df['City'] = ['Hyd', 'Blr', 'Chennai']

df.loc[[1,2],['Names','City']]

    Names     City
1  Suresh      Blr
2  Mahesh  Chennai

In [86]:
import pandas as pd

df = pd.DataFrame()
df['Names'] = ["Ramesh", "Suresh", "Mahesh"]
df['City'] = ['Hyd', 'Blr', 'Chennai']

df.loc[0:3,'City']

0        Hyd
1        Blr
2    Chennai
Name: City, dtype: object

In [137]:
df.loc[2]

Names     Mahesh
City     Chennai
Name: 2, dtype: object

In [139]:
df.loc[2]
type(df.loc[2])

pandas.core.series.Series

In [141]:
df.loc[[2]]

    Names     City
2  Mahesh  Chennai

In [101]:
type(df.loc[[2]])

pandas.core.frame.DataFrame

In [143]:
df.loc[[1,2]]

    Names     City
1  Suresh      Blr
2  Mahesh  Chennai

In [145]:
df.loc[[1,2]]
type(df.loc[[1,2]])

pandas.core.frame.DataFrame

In [147]:
df.loc[0:3]

    Names     City
0  Ramesh      Hyd
1  Suresh      Blr
2  Mahesh  Chennai

In [149]:
df.loc[0:3]
type(df.loc[0:3])

pandas.core.frame.DataFrame

In [153]:
df.loc[:]

    Names     City
0  Ramesh      Hyd
1  Suresh      Blr
2  Mahesh  Chennai

In [151]:
df.loc[:]
type(df.loc[:])

pandas.core.frame.DataFrame

In [155]:
df.loc[2,'City']

'Chennai'

In [157]:
df.loc[2,'City']
type(df.loc[2,'City'])

str

In [159]:
df.loc[2,['City']]

City    Chennai
Name: 2, dtype: object

In [161]:
df.loc[2,['City']]
type(df.loc[2,['City']])

pandas.core.series.Series

In [163]:
df.loc[[2],['City']]

      City
2  Chennai

In [165]:
df.loc[[2],['City']]
type(df.loc[[2],['City']])

pandas.core.frame.DataFrame

In [167]:
df.loc[[1,2],['Names','City']]

    Names     City
1  Suresh      Blr
2  Mahesh  Chennai

In [169]:
df.loc[[1,2],['Names','City']]
type(df.loc[[1,2],['Names','City']])

pandas.core.frame.DataFrame

In [171]:
df.loc[:,'City']

0        Hyd
1        Blr
2    Chennai
Name: City, dtype: object

In [173]:
df.loc[:,'City']
type(df.loc[:,'City'])

pandas.core.series.Series

In [175]:
df.loc[:,['City']]

      City
0      Hyd
1      Blr
2  Chennai

In [177]:
df.loc[:,['City']]
type(df.loc[:,['City']])

pandas.core.frame.DataFrame

**iloc**

In [182]:
df.iloc[2]

Names     Mahesh
City     Chennai
Name: 2, dtype: object

In [184]:
df.iloc[[2]]

    Names     City
2  Mahesh  Chennai

In [186]:
df.iloc[[1,2]]

    Names     City
1  Suresh      Blr
2  Mahesh  Chennai

In [188]:
df.iloc[0:3]

    Names     City
0  Ramesh      Hyd
1  Suresh      Blr
2  Mahesh  Chennai

In [190]:
df.iloc[:]

    Names     City
0  Ramesh      Hyd
1  Suresh      Blr
2  Mahesh  Chennai

In [206]:
df.iloc[1,1]

'Blr'

In [208]:
df.iloc[1,[1]]

City    Blr
Name: 1, dtype: object

In [210]:
df.iloc[[1],[1]]

  City
1  Blr

In [212]:
df.iloc[[0,1,],[0,1]]

    Names City
0  Ramesh  Hyd
1  Suresh  Blr

In [214]:
df.iloc[:,1]

0        Hyd
1        Blr
2    Chennai
Name: City, dtype: object

In [216]:
df.iloc[:,[1]]

      City
0      Hyd
1      Blr
2  Chennai

**Save the dataframe**

In [223]:
path1 = r"C:\Users\ACER\Desktop\cities.csv"
path2="cities.csv"
path3 = r"C:\Users\ACER\Desktop\cities.xlsx"
path4="cities.xlsx"
df.to_csv(path1)
df.to_csv(path2)
df.to_excel(path3)
df.to_excel(path4)

In [227]:
pd.read_csv(path1)

   Unnamed: 0   Names     City
0           0  Ramesh      Hyd
1           1  Suresh      Blr
2           2  Mahesh  Chennai

In [229]:
path1 = r"C:\Users\ACER\Desktop\cities.csv"
path2="cities.csv"
path3 = r"C:\Users\ACER\Desktop\cities.xlsx"
path4="cities.xlsx"
df.to_csv(path1,index=False)
df.to_csv(path2,index=False)
df.to_excel(path3,index=False)
df.to_excel(path4,index=False)

In [233]:
pd.read_excel(path3)

    Names     City
0  Ramesh      Hyd
1  Suresh      Blr
2  Mahesh  Chennai